In [1]:
print('all ok')

all ok

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

import seaborn as sns

In [2]:
df=pd.read_csv(r'../Datasets/titanic_train.csv',usecols=['Age','Pclass','SibSp','Parch','Survived'])
df.head()

   Survived  Pclass   Age  SibSp  Parch
0         0       3  22.0      1      0
1         1       1  38.0      1      0
2         1       3  26.0      0      0
3         1       1  35.0      1      0
4         0       3  35.0      0      0

In [3]:
df.dropna(inplace=True)
df.shape

(714, 5)

In [4]:
x=df.drop(columns=['Survived'],axis=1)
y=df['Survived']

In [5]:
x.head()

   Pclass   Age  SibSp  Parch
0       3  22.0      1      0
1       1  38.0      1      0
2       3  26.0      0      0
3       1  35.0      1      0
4       3  35.0      0      0

In [6]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring='accuracy',cv=10))

np.float64(0.6921165884194054)

### Feature Constraction

In [7]:
x['family_size']=x['Parch']+x['SibSp'] +1
x.head()

   Pclass   Age  SibSp  Parch  family_size
0       3  22.0      1      0            2
1       1  38.0      1      0            2
2       3  26.0      0      0            1
3       1  35.0      1      0            2
4       3  35.0      0      0            1

In [8]:
def myfunc(num):
    if num ==1:
        # alone
        return 0
    elif num>1 and num<=4:
        #small family
        return 1
    else:
        #large family
        return 2

In [10]:
x['family_type']=x['family_size'].apply(myfunc)

In [11]:
x.head()

   Pclass   Age  SibSp  Parch  family_size  family_type
0       3  22.0      1      0            2            1
1       1  38.0      1      0            2            1
2       3  26.0      0      0            1            0
3       1  35.0      1      0            2            1
4       3  35.0      0      0            1            0

In [13]:
new_x=x.drop(columns=['SibSp','Parch','family_size'])
new_x.head()

   Pclass   Age  family_type
0       3  22.0            1
1       1  38.0            1
2       3  26.0            0
3       1  35.0            1
4       3  35.0            0

In [14]:
np.mean(cross_val_score(LogisticRegression(),new_x,y,scoring='accuracy',cv=10))

np.float64(0.6963810641627542)

### Feature Splitting

In [15]:
df=pd.read_csv(r'../Datasets/titanic_train.csv',usecols=['Name','Survived'])
df.head()

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0                           Allen, Mr. William Henry

In [19]:
df['Title']=df['Name'].str.split(', ',expand=True)[1].str.split('.',expand=True)[0]

In [20]:
df.head()

   Survived                                               Name Title
0         0                            Braund, Mr. Owen Harris    Mr
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs
2         1                             Heikkinen, Miss. Laina  Miss
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs
4         0                           Allen, Mr. William Henry    Mr

In [29]:
(df.groupby('Title')['Survived'].mean()).sort_values(ascending=False)

Title
Lady            1.000000
Ms              1.000000
Sir             1.000000
Mme             1.000000
the Countess    1.000000
Mlle            1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Major           0.500000
Col             0.500000
Dr              0.428571
Mr              0.156673
Capt            0.000000
Jonkheer        0.000000
Don             0.000000
Rev             0.000000
Name: Survived, dtype: float64

In [30]:
df['Title'].value_counts()

Title
Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Col               2
Mlle              2
Major             2
Ms                1
Mme               1
Don               1
Lady              1
Sir               1
Capt              1
the Countess      1
Jonkheer          1
Name: count, dtype: int64